music_app/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_band
    @band = Band.find_by(id: params[:id])

SELECT "bands".* FROM "bands"
---
  def index
    @bands = Band.all

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "rolling stones"], ["created_at", "2023-01-18 23:00:32.278160"], ["updated_at", "2023-01-18 23:00:32.278160"]]
---
  def create
    @band = Band.new

    if @band.save

SELECT "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @band = Band.find_by(id: params[:id])