music_app/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(id: params[:id])

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "abc@abc.com"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2023-01-18 22:12:06.379590"], ["updated_at", "2023-01-18 22:12:06.379590"]]
---
  def create
    @user = User.new(user_params)

    if @user.save